MoseychukA/ADSB_TEST/Test_Pico/ADSB_Pico_25_06_17_10/cc1312.cpp
#include "cc1312.h"

// Get access to raw application binary for flashing.
#include "binaries.c"
#include "crc.h"  // For IEEE 802.3 CRC32 calculation.
#include "hal.h"

const CC1312::SPIPeripheralConfig kDefaultSPIPeripheralConfig;  // use defaults
const CC1312::SPIPeripheralConfig kBootloaderSPIPeripheralConfig = {
    .bits_per_transfer = 8,
    .cpol = SPI_CPOL_1,
    .cpha = SPI_CPHA_1,
    .order = SPI_MSB_FIRST,
};

bool CC1312::Init(bool spi_already_initialized) {
    // CC1312 enable pin.
    gpio_init(config_.enable_pin);
    SetEnable(SettingsManager::kEnableStateEnabled);  // Enable the CC1312.
    uint32_t enable_timestamp_ms = get_time_since_boot_ms();

    // CC1312 chip select pin.
    gpio_init(config_.spi_cs_pin);
    gpio_set_dir(config_.spi_cs_pin, GPIO_OUT);
    gpio_put(config_.spi_cs_pin, 1);  // Deselect the CC1312.
    // CC1312 IRQ pin.
    gpio_init(config_.irq_pin);
    gpio_set_dir(config_.irq_pin, GPIO_IN);
    gpio_set_pulls(config_.irq_pin, true, false);  // IRQ pin is pulled up.

    if (!spi_already_initialized) {
        // CC1312 SPI pins.
        gpio_set_function(config_.spi_clk_pin, GPIO_FUNC_SPI);
        gpio_set_function(config_.spi_mosi_pin, GPIO_FUNC_SPI);
        gpio_set_function(config_.spi_miso_pin, GPIO_FUNC_SPI);
        gpio_set_drive_strength(config_.spi_clk_pin, config_.spi_drive_strength);
        gpio_set_drive_strength(config_.spi_mosi_pin, config_.spi_drive_strength);
        gpio_set_drive_strength(config_.spi_cs_pin, config_.spi_drive_strength);
        gpio_set_pulls(config_.spi_clk_pin, config_.spi_pullup, config_.spi_pulldown);   // Clock pin pulls.
        gpio_set_pulls(config_.spi_mosi_pin, config_.spi_pullup, config_.spi_pulldown);  // MOSI pin pulls.
        gpio_set_pulls(config_.spi_cs_pin, config_.spi_pullup, config_.spi_pulldown);    // CS pin pulls.
        gpio_set_pulls(config_.spi_miso_pin, config_.spi_pullup, config_.spi_pulldown);  // MISO pin pulls.

        // Initialize SPI Peripheral.
        spi_init(config_.spi_handle, config_.spi_clk_freq_hz);
        spi_set_format(config_.spi_handle,
                       8,           // Bits per transfer.
                       SPI_CPOL_0,  // Polarity (CPOL).
                       SPI_CPHA_0,  // Phase (CPHA).
                       SPI_MSB_FIRST);
        active_clk_config_ = spi_get_clk();
        // Nobody else is on the bus yet, so we don't have to worry about restoring the standby clock config.
    } else {
        // SPI peripheral was already initialized. Make sure to not stomp on it when setting a clock rate.
        standby_clk_config_ = spi_get_clk();
        spi_set_baudrate(config_.spi_handle, config_.spi_clk_freq_hz);
        active_clk_config_ = spi_get_clk();
        spi_set_clk(standby_clk_config_);
    }

    while (get_time_since_boot_ms() - enable_timestamp_ms < kBootupDelayMs) {
    }

    CONSOLE_INFO("CC1312::Init", "Unable to communicate with CC1312. Entering bootloader mode.");
    if (!EnterBootloader()) {
        CONSOLE_ERROR("CC1312::Init", "Failed to enter bootloader mode.");
        return false;
    }
    if (!ApplicationIsUpToDate()) {
        CONSOLE_INFO("CC1312::Init", "Application is not up to date. Attempting to flash application binary.");
        if (!Flash()) {
            CONSOLE_ERROR("CC1312::Init", "Failed to flash application binary.");
            return false;
        }
        CONSOLE_INFO("CC1312::Init", "Application binary flashed successfully.");
        // Flash automatically exits bootloader mode.
    } else {
        CONSOLE_INFO("CC1312::Init", "Application is up to date. No need to flash.");
        if (!ExitBootloader()) {
            CONSOLE_ERROR("CC1312::Init", "Failed to exit bootloader mode.");
            return false;
        }
    }
    // TODO: Check that the CC1312 can be communicated with successfully.
    CONSOLE_INFO("CC1312::Init", "CC1312 initialized successfully.");

    return true;
}

bool CC1312::ApplicationIsUpToDate() {
    // Verify application binary.
    uint32_t table_crc = crc32_ieee_802_3(sub_ghz_radio_bin, sub_ghz_radio_bin_size);
    uint32_t device_crc = 0;
    if (!BootloaderCommandCRC32(device_crc, kBaseAddrFlashMem, sub_ghz_radio_bin_size)) {
        CONSOLE_ERROR("CC1312::ApplicationIsUpToDate", "Failed to calculate CRC32 of the application binary.");
        return false;
    }
    if (table_crc != device_crc) {
        CONSOLE_ERROR("CC1312::ApplicationIsUpToDate",
                      "CRC32 mismatch after flashing application binary. Expected 0x%x, got 0x%x.", table_crc,
                      device_crc);
        return false;
    }
    CONSOLE_PRINTF("CC1312::ApplicationIsUpToDate: Application binary flashed successfully, CRC32 matches: 0x%x.\r\n",
                   table_crc);
    return true;
}

bool CC1312::BootloaderCommandBankErase() {
    uint8_t cmd_buf[1] = {kCmdBankErase};
    if (!BootloaderSendBufferCheckSuccess(cmd_buf, sizeof(cmd_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandBankErase", "Failed to send bank erase command.");
        return false;
    }
    return true;
}

bool CC1312::BootloaderCommandCRC32(uint32_t& crc, uint32_t address, uint32_t num_bytes, uint32_t read_repeat_count) {
    uint8_t cmd_buf[13] = {kCmdCRC32,
                           static_cast<uint8_t>((address >> 24) & 0xFFu),
                           static_cast<uint8_t>((address >> 16) & 0xFFu),
                           static_cast<uint8_t>((address >> 8) & 0xFFu),
                           static_cast<uint8_t>(address & 0xFFu),
                           static_cast<uint8_t>((num_bytes >> 24) & 0xFFu),
                           static_cast<uint8_t>((num_bytes >> 16) & 0xFFu),
                           static_cast<uint8_t>((num_bytes >> 8) & 0xFFu),
                           static_cast<uint8_t>(num_bytes & 0xFFu),
                           static_cast<uint8_t>((read_repeat_count >> 24) & 0xFFu),
                           static_cast<uint8_t>((read_repeat_count >> 16) & 0xFFu),
                           static_cast<uint8_t>((read_repeat_count >> 8) & 0xFFu),
                           static_cast<uint8_t>(read_repeat_count & 0xFFu)};
    if (!BootloaderSendBuffer(cmd_buf, sizeof(cmd_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandCRC32", "Failed to send CRC32 command.");
        return false;
    }
    uint8_t crc_buf[4] = {0};
    if (!BootloaderReceiveBuffer(crc_buf, sizeof(crc_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandCRC32", "Failed to receive CRC32 result.");
        return false;
    }
    crc = (static_cast<uint32_t>(crc_buf[0]) << 24) | (static_cast<uint32_t>(crc_buf[1]) << 16) |
          (static_cast<uint32_t>(crc_buf[2]) << 8) | static_cast<uint32_t>(crc_buf[3]);
    return true;
}

