MoseychukA/ADSB_TEST/Test_Pico/ADSB_Pico_25_06_17_10/cc1312.cpp
bool CC1312::BootloaderCommandDownload(uint32_t address, uint32_t num_bytes) {
    uint8_t cmd_buf[9]{kCmdDownload,
                       static_cast<uint8_t>((address >> 24) & 0xFFu),
                       static_cast<uint8_t>((address >> 16) & 0xFFu),
                       static_cast<uint8_t>((address >> 8) & 0xFFu),
                       static_cast<uint8_t>(address & 0xFFu),
                       static_cast<uint8_t>((num_bytes >> 24) & 0xFFu),
                       static_cast<uint8_t>((num_bytes >> 16) & 0xFFu),
                       static_cast<uint8_t>((num_bytes >> 8) & 0xFFu),
                       static_cast<uint8_t>(num_bytes & 0xFFu)};
    if (!BootloaderSendBufferCheckSuccess(cmd_buf, sizeof(cmd_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandDownload",
                      "Failed to send download command. Firmware size or address might be invalid, or something else "
                      "went wrong.");
        return false;
    }
    return true;
}

CC1312::CommandReturnStatus CC1312::BootloaderCommandGetStatus() {
    uint8_t cmd_buf[1] = {kCmdGetStatus};
    if (!BootloaderSendBuffer(cmd_buf, sizeof(cmd_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandGetStatus", "Failed to send command.");
        return kCmdRetDriverError;
    }
    uint8_t status_buf[1] = {0};
    if (!BootloaderReceiveBuffer(status_buf, sizeof(status_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandGetStatus", "Failed to receive command status.");
        return kCmdRetDriverError;
    }
    CommandReturnStatus return_status = static_cast<CommandReturnStatus>(status_buf[0]);
    if (return_status != kCmdRetSuccess) {
        CONSOLE_ERROR("CC1312::BootloaderCommandGetStatus", "Command failed with status 0x%x. (%s).", return_status,
                      CommandReturnStatusToString(return_status));
        return return_status;
    }

    return return_status;
}

bool CC1312::BootloaderCommandPing() {
    uint8_t cmd_buf[1] = {kCmdPing};
    bool ping_acked = BootloaderSendBufferCheckSuccess(cmd_buf, sizeof(cmd_buf));
    if (!ping_acked) {
        CONSOLE_ERROR("CC1312::BootloaderCommandPing", "Ping command failed.");
        return false;
    }
    return true;
}

bool CC1312::BootloaderCommandReset() {
    uint8_t cmd_buf[1] = {kCmdReset};
    bool reset_acked = BootloaderSendBuffer(cmd_buf, sizeof(cmd_buf));
    if (!reset_acked) {
        CONSOLE_ERROR("CC1312::BootloaderCommandReset", "Reset command failed.");
        return false;
    }
    return true;
}

bool CC1312::BootloaderCommandSendData(const uint8_t* data, uint32_t data_len) {
    static const uint32_t kMaxDataLength = 255 - 3;  // Max packet length minus command, size, checksum Bytes.
    if (data_len > kMaxDataLength) {
        CONSOLE_ERROR("CC1312::BootloaderCommandSendData", "Data length %d exceeds maximum allowed length of %d bytes.",
                      data_len, kMaxDataLength);
        return false;
    }
    uint8_t cmd_buf[1 + data_len] = {0x0};
    cmd_buf[0] = kCmdSendData;
    memcpy(cmd_buf + 1, data, data_len);  // Copy the data to the command buffer.
    if (!BootloaderSendBufferCheckSuccess(cmd_buf, sizeof(cmd_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandSendData", "Programming failed.");
        return false;
    }
    return true;
}

bool CC1312::BootloaderCommandSetCCFG(BootloaderCCFGFieldID field_id, uint32_t value) {
    uint8_t cmd_buf[9] = {kCmdSetCCFG,
                          static_cast<uint8_t>((field_id >> 24) & 0xFFu),
                          static_cast<uint8_t>((field_id >> 16) & 0xFFu),
                          static_cast<uint8_t>((field_id >> 8) & 0xFFu),
                          static_cast<uint8_t>(field_id & 0xFFu),
                          static_cast<uint8_t>((value >> 24) & 0xFFu),
                          static_cast<uint8_t>((value >> 16) & 0xFFu),
                          static_cast<uint8_t>((value >> 8) & 0xFFu),
                          static_cast<uint8_t>(value & 0xFFu)};

    if (!BootloaderSendBufferCheckSuccess(cmd_buf, sizeof(cmd_buf))) {
        CONSOLE_ERROR("CC1312::BootloaderCommandSetCCFG", "Failed to send CCFG set command.");
        return false;
    }
    return true;
}

bool CC1312::BootloaderReadCCFGConfig(BootloaderCCFGConfig& ccfg_config) {
    uint32_t bl_config = 0;

    if (!BootloaderCommandMemoryRead(kBaseAddrCCFG + kCCFGRegOffBLConfig, &bl_config, 1)) {
        CONSOLE_ERROR("CC1312::BootloaderReadCCFGConfig", "Failed to read CCFG configuration.");
        return false;
    }

    ccfg_config.bl_enabled = ((bl_config >> 24) & 0xFF) == 0xC5;
    ccfg_config.bl_backdoor_level = (bl_config >> 16) & 0x01;       // Bit[16] is the backdoor level.
    ccfg_config.bl_backdoor_pin = (bl_config >> 8) & 0xFF;          // Bits[15:8] are the backdoor pin.
    ccfg_config.bl_backdoor_enabled = (bl_config & 0x0FF) == 0xC5;  // Bits[7:0] are the backdoor enabled flag.

    uint32_t erase_conf = 0;
    if (!BootloaderCommandMemoryRead(kBaseAddrCCFG + kCCFGRegOffEraseConf, &erase_conf, 1)) {
        CONSOLE_ERROR("CC1312::BootloaderReadCCFGConfig", "Failed to read CCFG erase configuration.");
        return false;
    }

    ccfg_config.chip_erase_disabled = ((erase_conf >> 8) & 0b1) == 0;  // Bit[8] is the chip erase disabled flag.
    ccfg_config.bank_erase_disabled = (erase_conf & 0b1) == 0;         // Bit[0] is the bank erase disabled flag.

    return true;
}

bool CC1312::BootloaderWriteCCFGConfig(const BootloaderCCFGConfig& ccfg_config) {
    if (!BootloaderCommandSetCCFG(kCCFGFieldIDIDBankEraseDis, ccfg_config.bank_erase_disabled ? 0 : 1)) {
        CONSOLE_ERROR("CC1312::BootloaderWriteCCFGConfig", "Failed to set bank erase disabled CCFG field.");
        return false;
    }
    if (!BootloaderCommandSetCCFG(kCCFGFieldIDChipEraseDis, ccfg_config.chip_erase_disabled ? 0 : 1)) {
        CONSOLE_ERROR("CC1312::BootloaderWriteCCFGConfig", "Failed to set chip erase disabled CCFG field.");
        return false;
    }
    if (!BootloaderCommandSetCCFG(kCCFGFieldIDBLBackdoorEn, ccfg_config.bl_backdoor_enabled ? 0xC5 : 0xFF)) {
        CONSOLE_ERROR("CC1312::BootloaderWriteCCFGConfig", "Failed to set bootloader backdoor enabled CCFG field.");
        return false;
    }
    if (!BootloaderCommandSetCCFG(kCCFGFieldIDBLBackdoorPin, ccfg_config.bl_backdoor_pin)) {
        CONSOLE_ERROR("CC1312::BootloaderWriteCCFGConfig", "Failed to set bootloader backdoor pin CCFG field.");
        return false;
    }
    if (!BootloaderCommandSetCCFG(kCCFGFieldIDBackdoorLevel, ccfg_config.bl_backdoor_level ? 1 : 0)) {
        CONSOLE_ERROR("CC1312::BootloaderWriteCCFGConfig", "Failed to set bootloader backdoor level CCFG field.");
        return false;
    }
    if (!BootloaderCommandSetCCFG(kCCFGFieldIDBLEnable, ccfg_config.bl_enabled ? 0xC5 : 0xFF)) {
        CONSOLE_ERROR("CC1312::BootloaderWriteCCFGConfig", "Failed to set bootloader enabled CCFG field.");
        return false;
    }

