MoseychukA/ADSB_TEST/Test_Pico/ADSB_Pico_25_06_17_10/cc1312.cpp
    return true;
}

bool CC1312::EnterBootloader() {
    SetEnable(SettingsManager::kEnableStateDisabled);
    gpio_put(config_.sync_pin, 1);
    SetEnable(SettingsManager::kEnableStateEnabled);
    in_bootloader_ = true;
    sleep_ms(kBootupDelayMs);  // Wait for the CC1312 to boot up.

    return BootloaderCommandPing();
}

bool CC1312::ExitBootloader() {
    in_bootloader_ = false;
    SetEnable(SettingsManager::kEnableStateDisabled);
    gpio_put(config_.sync_pin, 0);
    SetEnable(SettingsManager::kEnableStateEnabled);

    return true;
}

bool CC1312::BootloaderReceiveBuffer(uint8_t* buf, uint16_t buf_len_bytes) {
    uint8_t rx_buf[buf_len_bytes + 2] = {0};  // Includes size Byte and checksum Byte.
    uint32_t start_time_ms = get_time_since_boot_ms();
    bool received_response = false;
    while (!received_response) {
        if (get_time_since_boot_ms() - start_time_ms > kSPITransactionTimeoutMs) {
            SPIEndTransaction();  // End transaction after error.
            CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer", "Timed out waiting for response from CC1312.");
            return false;
        }

        // Read the first byte of the response.
        int16_t bytes_read = SPIReadBlocking(rx_buf, 1, false);
        if (bytes_read < 0) {
            SPIEndTransaction();  // End transaction after error.
            CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer",
                          "Failed to read response, SPI write read call returned error code 0x%x.", bytes_read);
            return false;
        } else if (bytes_read != 1) {
            SPIEndTransaction();  // End transaction after error.
            CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer",
                          "Failed to read first Byte of response, expected %d Bytes but read %d.", 1, bytes_read);
            return false;
        } else if (rx_buf[0] != 0) {
            received_response = true;
        }
    }

    uint16_t rx_len_bytes = rx_buf[0];
    uint8_t calculated_checksum = 0;

    int16_t bytes_read =
        SPIReadBlocking(rx_buf + 1, rx_len_bytes - 1, false);  // End transaction after reading the buffer.
    bool read_success = true;
    if (bytes_read < 0) {
        CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer",
                      "Failed to read response, SPI write read call returned error code 0x%x.", bytes_read);
        read_success = false;
    } else if (bytes_read != rx_len_bytes - 1) {
        CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer", "Failed to read response, expected %d Bytes but read %d.",
                      rx_len_bytes - 1, bytes_read);
        read_success = false;
    } else {
        // Verify received checksum.
        uint16_t received_checksum = rx_buf[1];
        for (uint16_t i = 2; i < rx_len_bytes; i++) {
            calculated_checksum += rx_buf[i];
        }
        if (calculated_checksum != received_checksum) {
            CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer", "Checksum mismatch, expected 0x%x but got 0x%x.",
                          received_checksum, calculated_checksum);
            read_success = false;
        }
    }
    uint8_t ack_nack_byte = read_success ? ProtocolByte::kProtocolByteAck : ProtocolByte::kProtocolByteNack;
    SPIWriteBlocking(&ack_nack_byte, 1, true);  // Send ACK or NACK back to the CC1312, then end the transaction.
    if (!read_success) {
        return false;
    }

    // Copy the buffer to the output buffer.
    if (buf_len_bytes < rx_len_bytes - 2) {
        CONSOLE_ERROR("CC1312::BootloaderReceiveBuffer", "Buffer too small, expected %d bytes but got %d.",
                      buf_len_bytes, rx_len_bytes - 2);
        return false;
    }
    memcpy(buf, rx_buf + 2, rx_len_bytes - 2);  // Copy the buffer to the output buffer.
    return true;
}

bool CC1312::BootloaderSendBuffer(uint8_t* buf, uint16_t buf_len_bytes) {
    // Prepare the buffer to send.
    // Send packet size is (buf_len_bytes + size Byte + checksum Byte).
    uint8_t tx_len_bytes = buf_len_bytes + 2;
    uint8_t checksum = 0;
    for (uint16_t i = 0; i < buf_len_bytes; i++) {
        checksum += buf[i];
    }
    uint8_t tx_buf[tx_len_bytes] = {0};
    tx_buf[0] = tx_len_bytes;
    tx_buf[1] = checksum;
    memcpy(tx_buf + 2, buf, buf_len_bytes);
    uint32_t start_time_ms = get_time_since_boot_ms();

    // Send the buffer.
    int16_t bytes_written =
        SPIWriteBlocking(tx_buf, tx_len_bytes,
                         false);  // Don't end transaction, keep reading till we get a nonzero response.
    if (bytes_written < 0) {
        SPIEndTransaction();  // End transaction after error.
        CONSOLE_ERROR("CC1312::BootloaderSendBuffer",
                      "Failed to send buffer, SPI write read call returned error code 0x%x.", bytes_written);
        return false;
    } else if (bytes_written < tx_len_bytes) {
        SPIEndTransaction();  // End transaction after error.
        CONSOLE_ERROR("CC1312::BootloaderSendBuffer", "Failed to send buffer, only %d bytes written.", bytes_written);
        return false;
    }

    // Wait for a response.
    bool got_response = false;
    uint8_t rx_byte;
    while (!got_response) {
        if (get_time_since_boot_ms() - start_time_ms > kSPITransactionTimeoutMs) {
            SPIEndTransaction();  // End transaction after error.
            CONSOLE_ERROR("CC1312::BootloaderSendBuffer", "Timed out waiting for response from CC1312.");
            return false;
        }

        rx_byte = 0;
        int16_t bytes_read = SPIReadBlocking(&rx_byte, 1, false);
        if (bytes_read < 0) {
            SPIEndTransaction();  // End transaction after error.
            CONSOLE_ERROR("CC1312::BootloaderSendBuffer",
                          "Failed to read response, SPI write read call returned error code 0x%x.", bytes_read);
            return false;
        } else if (bytes_read != 1) {
            SPIEndTransaction();  // End transaction after error.
            CONSOLE_ERROR("CC1312::BootloaderSendBuffer", "Failed to read response, only %d Bytes read.", bytes_read);
            return false;
        } else if (rx_byte != 0) {
            got_response = true;
            SPIEndTransaction();  // End the transaction after receiving a response.
        }
    }

    // Interpret the response.
    if (rx_byte == ProtocolByte::kProtocolByteNack) {
        CONSOLE_ERROR("CC1312::BootloaderSendBuffer", "Received NACK from CC1312.");
        return false;
    } else if (rx_byte != kProtocolByteAck) {
        CONSOLE_ERROR("CC1312::BootloaderSendBuffer", "Received unknown response from CC1312: 0x%x.", rx_byte);
        return false;
    }
    return true;
}

