MoseychukA/ADSB_TEST/Test_Pico/ADSB_Pico_25_06_17_10/cc1312.cpp
bool CC1312::BootloaderSendBufferCheckSuccess(uint8_t* buf, uint16_t buf_len_bytes) {
    if (!BootloaderSendBuffer(buf, buf_len_bytes)) {
        CONSOLE_ERROR("CC1312::BootloaderSendBufferCheckSuccess", "Failed to send command.");
        return false;
    }
    if (BootloaderCommandGetStatus() != kCmdRetSuccess) {
        CONSOLE_ERROR("CC1312::BootloaderSendBufferCheckSuccess", "Command was sent but was unsuccessful.");
        return false;
    }
    return true;
}

bool CC1312::Flash() {
    CONSOLE_PRINTF("CC1312::Flash: Entering bootloader.\r\n");
    if (!EnterBootloader()) {
        CONSOLE_ERROR("CC1312::Flash", "Failed to enter bootloader mode.");
        return false;
    }

    // Erase the chip.
    CONSOLE_PRINTF("CC1312::Flash: Beginning flash erase.\r\n");
    if (!BootloaderCommandBankErase()) {
        CONSOLE_ERROR("CC1312::Flash", "Failed to erase the chip.");
        return false;
    }
    CONSOLE_PRINTF("CC1312::Flash: Flash erase complete.\r\n");
    // Re-write the CCFG configuration.
    CONSOLE_PRINTF("CC1312::Flash: Writing CCFG configuration.\r\n");
    if (!BootloaderWriteCCFGConfig(config_.ccfg_config)) {
        CONSOLE_ERROR("CC1312::Flash", "Failed to write CCFG configuration.");
        return false;
    }
    CONSOLE_PRINTF("CC1312::Flash: Verifying CCFG configuration.\r\n");
    BootloaderCCFGConfig ccfg_config;
    if (!BootloaderReadCCFGConfig(ccfg_config)) {
        CONSOLE_ERROR("CC1312::Flash", "Failed to read CCFG configuration.");
        return false;
    }
    char ccfg_config_str[256];
    ccfg_config.print_to_buffer(ccfg_config_str, sizeof(ccfg_config_str));
    CONSOLE_PRINTF("CC1312::Flash: CCFG configuration read:\r\n%s", ccfg_config_str);
    if (ccfg_config != config_.ccfg_config) {
        char expected_ccfg_config_str[256];
        config_.ccfg_config.print_to_buffer(expected_ccfg_config_str, sizeof(expected_ccfg_config_str));
        CONSOLE_ERROR("CC1312::Flash",
                      "CCFG configuration does not match expected values after writing. Expected:\r\n%s, "
                      "Got:\r\n%s",
                      expected_ccfg_config_str, ccfg_config_str);
        return false;
    }
    CONSOLE_PRINTF("CC1312::Flash: CCFG configuration written and verified successfully.\r\n");

    CONSOLE_PRINTF("CC1312::Flash: Beginning flash programming. Application is %d Bytes\r\n", sub_ghz_radio_bin_size);

    // Send the download command.
    if (!BootloaderCommandDownload(kBaseAddrFlashMem, sub_ghz_radio_bin_size)) {
        CONSOLE_ERROR("CC1312::Flash", "Failed to send download command.");
        return false;
    }
    CONSOLE_PRINTF("CC1312::Flash: Download command sent successfully.\r\n");

    // Send the application binary data.
    uint32_t flash_offset = 0;
    uint32_t num_chunks = sub_ghz_radio_bin_size / kBootloaderCommandSendDataMaxLenBytes +
                          (sub_ghz_radio_bin_size % kBootloaderCommandSendDataMaxLenBytes != 0 ? 1 : 0);
    uint32_t current_chunk = 0;
    while (flash_offset < sub_ghz_radio_bin_size) {
        uint32_t bytes_to_send = MIN(sub_ghz_radio_bin_size - flash_offset, kBootloaderCommandSendDataMaxLenBytes);
        if (!BootloaderCommandSendData(sub_ghz_radio_bin + flash_offset, bytes_to_send)) {
            CONSOLE_ERROR("CC1312::Flash", "Failed to send application data at offset %d.", flash_offset);
            // TODO: Attempt a retry here?
            return false;
        }
        flash_offset += bytes_to_send;
        current_chunk++;
        CONSOLE_PRINTF("CC1312::Flash: Sent %d Bytes, total sent: %d Bytes [%d / %d chunks].\r\n", bytes_to_send,
                       flash_offset, current_chunk, num_chunks);
    }
    CONSOLE_PRINTF("CC1312::Flash: Application data sent successfully.\r\n");

    if (!ApplicationIsUpToDate()) {
        CONSOLE_ERROR("CC1312::Flash", "Application is not up to date after flashing.");
        return false;
    }
    CONSOLE_PRINTF("CC1312::Flash: Application is up to date.\r\n");

    if (!ExitBootloader()) {
        CONSOLE_ERROR("CC1312::Flash", "Failed to exit bootloader mode.");
        return false;
    }
    CONSOLE_PRINTF("CC1312::Flash: Exited bootloader mode successfully.\r\n");

    return true;
}

void CC1312::SPIBeginTransaction() {
    if (in_bootloader_) {
        // Bootlaoder is active, override CPHA and CPOL.
        spi_set_format(config_.spi_handle, kBootloaderSPIPeripheralConfig.bits_per_transfer,
                       kBootloaderSPIPeripheralConfig.cpol, kBootloaderSPIPeripheralConfig.cpha,
                       kBootloaderSPIPeripheralConfig.order);
    }
    standby_clk_config_ = spi_get_clk();  // Save existing clock config.
    spi_set_clk(active_clk_config_);

    gpio_put(config_.spi_cs_pin, false);
}

void CC1312::SPIEndTransaction() {
    gpio_put(config_.spi_cs_pin, true);

    spi_set_clk(standby_clk_config_);  // Restore clock config.
    if (in_bootloader_) {
        // Bootlaoder is active, restore CPHA and CPOL.
        spi_set_format(config_.spi_handle, kDefaultSPIPeripheralConfig.bits_per_transfer,
                       kDefaultSPIPeripheralConfig.cpol, kDefaultSPIPeripheralConfig.cpha,
                       kDefaultSPIPeripheralConfig.order);
    }
}

int CC1312::SPIWriteReadBlocking(uint8_t* tx_buf, uint8_t* rx_buf, uint16_t len_bytes, bool end_transaction) {
    int bytes_written = 0;

    SPIBeginTransaction();

    if (tx_buf == nullptr) {
        // Transmit 0's when reading.
        bytes_written = spi_read_blocking(config_.spi_handle, 0x0, rx_buf, len_bytes);
    } else if (rx_buf == nullptr) {
        bytes_written = spi_write_blocking(config_.spi_handle, tx_buf, len_bytes);
    } else {
        bytes_written = spi_write_read_blocking(config_.spi_handle, tx_buf, rx_buf, len_bytes);
    }

    if (bytes_written < 0) {
        CONSOLE_ERROR("SPICoprocessor::SPIWriteReadBlocking", "SPI write read call returned error code 0x%x.",
                      bytes_written);
    }

    if (end_transaction) {
        SPIEndTransaction();
    }
    return bytes_written;
}